package com.example.composetry.data

import com.example.composetry.R

fun listOfMemories() = mutableListOf(
    MemoryData(R.drawable.gk, "ул, Большая Садовая 105/42", "+78633051990", "Главный корпус Южного Федерального Университета"),
    MemoryData(R.drawable.mechm, "ул. Мильчакова 8а", "+78632975111", "Институт математики, механики и компьютерных наук им. И.И. Воровича"),
    MemoryData(R.drawable.fiz, "ул. Зорге 5", "+78632975072", "Физический факультет Южного Федерального Университета"),
    MemoryData(R.drawable.him, "ул. Зорге 7", "+78632975151", "Химический факультет Южного Федерального Университета"),
    MemoryData(R.drawable.earth, "ул. Зорге 40", "+78632225701", "Институт наук о Земле Южного Федерального Университета"),
    MemoryData(R.drawable.eko, "ул. Максима Горького 88", "+78632403610","Экономический и Юридический факультеты Южного Федерального Университета"),
    MemoryData(R.drawable.pezo, "ул. Мильчакова 10", "+78632434811", "Институт высоких технологий и пьезотехники Южного Федерального Университета")
)